Revit 2026 API

# FaceWallIsValidFaceReferenceForFaceWall Method

---

Identifies if a reference may be used as the parent of a face wall.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidFaceReferenceForFaceWall(
	Document document,
	Reference faceReference
)
```
```vb
Public Shared Function IsValidFaceReferenceForFaceWall (
	document As Document,
	faceReference As Reference
) As Boolean
```
```cpp
public:
static bool IsValidFaceReferenceForFaceWall(
	Document^ document,
	Reference^ faceReference
)
```
```fsharp
static member IsValidFaceReferenceForFaceWall :
        document : Document *
        faceReference : Reference -> bool
```

#### Parameters

document Document
     The document.
faceReference Reference
     The reference.

#### Return Value

Boolean True if the reference is valid as a parent to a face wall, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The reference must represent a face of a massing instance, and must be planar, and its normal must not be vertical or horizontal.

#### Reference

FaceWall Class

Autodesk.Revit.DB Namespace